config.org
#+TITLE: La Configuración de DOOM Emacs de Tarbolin69
#+PROPERTY: header-args :tangle config.el

[[https://github.com/doomemacs/doomemacs][-> Instrucciones para instalar DOOM Emacs <-]]

GNU Emacs, también conocido como el Monstruo del Dr. Stallman, es un editor de texto GUI (contrario a Vim, que es CLI (a menos que uses GVIM, en cuyo caso tendrías que matarte)). A diferencia de otros editores GUI como VS Code o uno de 50 IDEs de JetBrains, es mucho, MUCHO menos pesado, permite mucha mas configuración, y contiene cosas como:

+ Un gestor de archivos
+ Diferentes terminales nativas
+ Opciones gráficas (es un GUI)
+ Agregador de noticias (RSS)
+ Gestor de EMAIL
+ Reproductor de musica
+ Navegador Web

Entro otras muchas. Técnicamente, podrías usar SOLAMENTE Emacs como tu Gestor de Ventanas (WM), y no te faltaría nada. ¿Significa esto que Emacs es el mejor editor de código? Ni en pedo. Si, hablando objetivamente es el mas completo al ser básicamente un sistema operativo, pero yo, por lo menos, sigo usando primariamente Vim—es mas útil para las cosas que YO hago. Pero, esto no significa que Emacs no sea bueno. Tiene muchas cosas piola como org-mode, que es lo que yo uso para tomar notas y hacer "README"s como este usando la opción ":tangle" que tiene. Tiene buen soporte de auto-completado para código. Permite crear paginas HTML a partir de documentos org, y así. En todo honestidad, también se ve mejor que Vim (y yo, por supuesto, soy muy vanidoso ¯\_(ツ)_/¯ ).

Doom EMACS, que es lo que uso yo, es básicamente un GNU Emacs pre-configurado con cosas que uno ya de por si usaría. Corre rápido, bastante rápido, y tiene las combinaciones de teclas de Vim (nadie usa las de Emacs, lo siento pero son malísimas). Es mejor de usar Emacs solo? Para mi si, ya que no tengo muchas ganas de pasarme los próximos 20 años para tener una configuración de Emacs parecida a esta. ¿Quiero entonces decir que no uses Emacs solo? No. Crear tu propio Emacs desde cero es una muy buena experiencia y practica, aparte de que permite tener solamente lo que quieras y necesites. Quizá te caen mal varias de las cosas de DOOM Emacs, y estas deconstruyendolo mas que construyéndolo—en ese caso, quizá seria mejor empezar en blanco. Yo solamente soy medio vago, y me gusta lo que DOOM Emacs trae.

* TABLA DE CONTENIDOS :toc:
- [[#lenguaje][LENGUAJE]]
- [[#prefacio][PREFACIO]]
- [[#beacon][BEACON]]
- [[#marcadores-y-buffers][MARCADORES Y BUFFERS]]
  - [[#marcadores][Marcadores]]
  - [[#buffers][Buffers]]
  - [[#combinaciones-de-teclas-dentro-del-modo-ibuffer][Combinaciones de Teclas Dentro del Modo Ibuffer]]
- [[#pestañas][PESTAÑAS]]
- [[#clippy][CLIPPY]]
- [[#tablero][TABLERO]]
  - [[#configuración-del-tablero][Configuración del Tablero]]
  - [[#tablero-en-emacsclient][Tablero en Emacsclient]]
- [[#dired][DIRED]]
  - [[#combinación-de-teclas-para-abrir-dired][Combinación de Teclas para Abrir Dired]]
  - [[#combinaciones-de-teclas-dentro-de-dired][Combinaciones de Teclas Dentro de Dired]]
  - [[#combinaciones-de-teclado-con-pee-dired-activado][Combinaciones de Teclado con Pee-Dired Activado]]
- [[#temas-doom][TEMAS DOOM]]
- [[#emojis][EMOJIS]]
- [[#evaluar-expresiones-elisp][EVALUAR EXPRESIONES ELISP]]
- [[#tipo-de-fuente-tipográfica][TIPO DE FUENTE TIPOGRÁFICA]]
- [[#insertar-fecha][INSERTAR FECHA]]
- [[#ivy][IVY]]
  - [[#ivy-posframe][IVY-POSFRAME]]
  - [[#ivy-keybindings][IVY KEYBINDINGS]]
- [[#confugracion-de-lineas][CONFUGRACION DE LINEAS]]
- [[#minimapa][MINIMAPA]]
- [[#linea-de-modos][LINEA DE MODOS]]
- [[#soporte-para-raton][SOPORTE PARA RATON]]
- [[#neotree][NEOTREE]]
- [[#abrir-archivos-especificos][ABRIR ARCHIVOS ESPECIFICOS]]
- [[#modo-org][MODO ORG]]
  - [[#org-export][Org-export]]
  - [[#org-journal][Org-journal]]
  - [[#org-auto-tangle][Org-auto-tangle]]
- [[#modo-arcoiris][MODO ARCOIRIS]]
- [[#registros][REGISTROS]]
- [[#shells][SHELLS]]
- [[#splits][SPLITS]]
- [[#modo-winner][MODO WINNER]]
- [[#zap-to-char][ZAP-TO-CHAR]]

* LENGUAJE
Esto es para decirle a flyspell, el auto-corrector usado acá, que use el diccionario español.
#+begin_src emacs-lisp
(ispell-change-dictionary "espanol" t)
#+end_src

* PREFACIO
Esta configuración asume que usas también mi "init.el" y "packages.el", o si no, algunas (muchas) cosas no van a andar. Si no los vas a usar, al menos fíjate que tengas activados y/o instalados los paquetes y otras necesidades relacionadas a esta configuración. Cuando quieras editar config.el, editas (o añadí) este documento, config.org. Los cambios se van a guardar automáticamente en config.el cuando salves.

Agradecimientos a Derek Taylor, quien fue la inspiración para esta configuración.

* BEACON
Hace que brille el cursor cuando te mueves para no perderlo. Esto lo hace una variable global.

#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

* MARCADORES Y BUFFERS

** Marcadores
Con los marcadores, uno puedo poner ciertos artículos en "favoritos" y acceder a ellos cuando quiero (incluso despues de cerrar la sesion actual de Emacs). Y, si esta configurado, aparecen también en el tablero cuando entras a DOOM Emacs

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("b". "buffer")
       :desc "Listar marcadores" "L" #'list-bookmarks
       :desc "Salvar los marcadores actuales al documento de marcadores" "w" #'bookmark-save))
#+end_src

** Buffers
Cuando abrís un archivo, cuando abrís dired, cuando haces casi TODO en Emacs, lo que estas viendo es un buffer. Lo que hace ibuffer es darte una lista de todos tus buffers, asi como tambien las herramientas para navegarlos y filtrarlos.

| COMANDO         | DESCRIPCIÓN             | COMBINACIÓN DE TECLAS |
|-----------------+-------------------------+-----------------------|
| ibuffer         | Lanzar ibuffer          | SPC b i               |
| kill-buffer     | Cerrar el buffer actual | SPC b k               |
| next-buffer     | Ir al buffer siguiente  | SPC b n               |
| previous-buffer | Ir al buffer previo     | SPC b p               |
| save-buffer     | Guardar buffer actual   | SPC b s               |

** Combinaciones de Teclas Dentro del Modo Ibuffer
| COMANDO                           | DESCRIPCIÓN                                 | COMBINACIÓN DE TECLAS |
|-----------------------------------+---------------------------------------------+-----------------------|
| ibuffer-mark-forward              | Marcar el buffer                            | m                     |
| ibuffer-unmark-forward            | Desmarcar el buffer                         | u                     |
| ibuffer-do-kill-on-deletion-marks | Cerrar los buffer marcados                  | x                     |
| ibuffer-filter-by-content         | Ibuffer filtro por contenido                | f c                   |
| ibuffer-filter-by-directory       | Ibuffer filtro por directorio               | f d                   |
| ibuffer-filter-by-filename        | Ibuffer filtro por nombre (camino completo) | f f                   |
| ibuffer-filter-by-mode            | Ibuffer filtro por modo                     | f m                   |
| ibuffer-filter-by-name            | Ibuffer filtro por nombre                   | f n                   |
| ibuffer-filter-disable            | Deshabilitar filtro de ibuffer               | f x                   |
| ibuffer-do-kill-lines             | Ocultar buffers marcados                    | g h                   |
| ibuffer-update                    | Restaurar buffers ocultos                   | g H                   |

* PESTAÑAS
Para activar las pestañas, descomenta "tabs" en init.el. Básicamente funcionan como las pestañas de un navegador como Chrome, y hacen el editar múltiples documentos un poco mas cómodo. Lo siguiente son algunas combinaciones de teclas para manejar dichas pestañas.

| COMANDO                     | DESCRIPCIÓN                            | COMBINACIÓN DE TECLAS |
|-----------------------------+----------------------------------------+-----------------------|
| centaur-tabs-mode           | /Alternar pestañas globalmente/          | SPC t c               |
| centaur-tabs-local-mode     | /Alternar pestañas en la pantalla local/ | SPC t C               |
| centaur-tabs-forward        | /Pestaña siguiente/                      | g <right> or g t      |
| centaur-tabs-backward       | /Pestaña previa/                         | g <left> or g T       |
| centaur-tabs-forward-group  | /Grupo de pestañas siguiente/            | g <down>              |
| centaur-tabs-backward-group | /Grupo de pestañas previo/               | g <up>                |

#+begin_src emacs-lisp
(setq centaur-tabs-set-bar 'over
      centaur-tabs-set-icons t
      centaur-tabs-gray-out-icons 'buffer
      centaur-tabs-height 24
      centaur-tabs-set-modified-marker t
      centaur-tabs-style "bar"
      centaur-tabs-modified-marker "•")
(map! :leader
      :desc "Alternar pestañas globalmente" "t c" #'centaur-tabs-mode
      :desc "Alternar pestañas en la pantalla local" "t C" #'centaur-tabs-local-mode)
; Aca usas las flechas para nagevar las pestañas. Flecha derecha (right) e izquierda (left) son para ir a la pestaña siguiente y previa, respectivamente. Abajo (down) y arriba (up) son para alternar entre grupos de pestaña (siguiente y previa, respectivamente).
(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward
                                               (kbd "g <left>")  'centaur-tabs-backward
                                               (kbd "g <down>")  'centaur-tabs-forward-group
                                               (kbd "g <up>")    'centaur-tabs-backward-group)
#+end_src

* CLIPPY
Vuelve el pelotudo de Microsoft Office! Este monito nos ayudara describiendo funciones y variables cuando usamos las teclas correspondientes mientras esta el cursor arriba de lo que queremos explicado. Usando esto, se nos va a aparecer una pequeña ventana con documentación y el grande y famoso Clippy en carne y hueso.

| COMANDO                  | DESCRIPCIÓN                                 | COMBINACIÓN DE TECLAS |
|--------------------------+---------------------------------------------+-----------------------|
| clippy-describe-function | /Clippy describe una función bajo el cursor/  | SPC c h f             |
| clippy-describe-variable | /Clippy describe una variable bajo el cursor/ | SPC c h v             |

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("c h" . "Invocar a Clippy")
       :desc "Clippy describe una función bajo el cursor" "f" #'clippy-describe-function
       :desc "Clippy describe una variable bajo el cursor" "v" #'clippy-describe-variable))
#+end_src

* TABLERO

** Configuración del Tablero
El tablero de Emacs es lo primero que vez cuando lo abrís. Te muestra tus archivos recientes, tus marcadores, tus agendas, configuraciones y la imagen (o ASCII) que has elegido para aparecer en el mismo. DOOM Emacs ya vieno con su propio tablero pre-configurado, que esta bastante bueno, asi que si queres podes comentar esta sección del documeto y seguir adelante.

#+begin_src emacs-lisp
(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Salve Regina")))
(defun title ()
  (let* ((banner '(" ████████╗ █████╗ ██████╗ ██████╗  ██████╗ ██╗     ██╗███╗   ██╗ ██████╗ █████╗  "
                   " ╚══██╔══╝██╔══██╗██╔══██╗██╔══██╗██╔═══██╗██║     ██║████╗  ██║██╔════╝██╔══██╗ "
                   "    ██║   ███████║██████╔╝██████╔╝██║   ██║██║     ██║██╔██╗ ██║███████╗╚██████║ "
                   "    ██║   ██╔══██║██╔══██╗██╔══██╗██║   ██║██║     ██║██║╚██╗██║██╔═══██╗╚═══██║ "
                   "    ██║   ██║  ██║██║  ██║██████╔╝╚██████╔╝███████╗██║██║ ╚████║╚██████╔╝█████╔╝ "
                   "    ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚══════╝╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚════╝  "
                   "                               ~~  Avra Kehdabra ~~                              "))

         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'title)

; Aca remuevo algunos botones, ya sea porque no los uso o porque los abro de otra manera.
(assoc-delete-all "Reload last session" +doom-dashboard-menu-sections)
(assoc-delete-all "Open documentation" +doom-dashboard-menu-sections)
(assoc-delete-all "Open org-agenda" +doom-dashboard-menu-sections)
#+end_src

