config.el
(beacon-mode 1)

(map! :leader
      (:prefix ("b". "buffer")
       :desc "Listar marcadores" "L" #'list-bookmarks
       :desc "Salvar los marcadores actuales al documento de marcadores" "w" #'bookmark-save))

(setq centaur-tabs-set-bar 'over
      centaur-tabs-set-icons t
      centaur-tabs-gray-out-icons 'buffer
      centaur-tabs-height 24
      centaur-tabs-set-modified-marker t
      centaur-tabs-style "bar"
      centaur-tabs-modified-marker "•")
(map! :leader
      :desc "Alternar pestañas globalmente" "t c" #'centaur-tabs-mode
      :desc "Alternar pestañas en la pantalla local" "t C" #'centaur-tabs-local-mode)
; Aca usas las flechas para nagevar las pestañas. Flecha derecha (right) e izquierda (left) son para ir a la pestaña siguiente y previa, respectivamente. Abajo (down) y arriba (up) son para alternar entre grupos de pestaña (siguiente y previa, respectivamente).
(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward
                                               (kbd "g <left>")  'centaur-tabs-backward
                                               (kbd "g <down>")  'centaur-tabs-forward-group
                                               (kbd "g <up>")    'centaur-tabs-backward-group)

(map! :leader
      (:prefix ("c h" . "Invocar a Clippy")
       :desc "Clippy describe una funcion bajo el cursor" "f" #'clippy-describe-function
       :desc "Clippy describe una variable bajo el cursor" "v" #'clippy-describe-variable))

(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Salve Regina")))
(defun title ()
  (let* ((banner '(" ████████╗ █████╗ ██████╗ ██████╗  ██████╗ ██╗     ██╗███╗   ██╗ ██████╗ █████╗  "
                   " ╚══██╔══╝██╔══██╗██╔══██╗██╔══██╗██╔═══██╗██║     ██║████╗  ██║██╔════╝██╔══██╗ "
                   "    ██║   ███████║██████╔╝██████╔╝██║   ██║██║     ██║██╔██╗ ██║███████╗╚██████║ "
                   "    ██║   ██╔══██║██╔══██╗██╔══██╗██║   ██║██║     ██║██║╚██╗██║██╔═══██╗╚═══██║ "
                   "    ██║   ██║  ██║██║  ██║██████╔╝╚██████╔╝███████╗██║██║ ╚████║╚██████╔╝█████╔╝ "
                   "    ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚══════╝╚═╝╚═╝  ╚═══╝ ╚═════╝ ╚════╝  "
                   "                               ~~  Avra Kehdabra ~~                              "))

         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'title)

; Aca remuevo algunos botones, ya sea porque no los uso o porque los abro de otra manera.
(assoc-delete-all "Reload last session" +doom-dashboard-menu-sections)
(assoc-delete-all "Open documentation" +doom-dashboard-menu-sections)
(assoc-delete-all "Open org-agenda" +doom-dashboard-menu-sections)
