config.org
** Tablero en Emacsclient
Esto es para que el cliente de emacs, si esta activado, siempre se abra en el tablero.

#+begin_src emacs-lisp
(setq doom-fallback-buffer-name "*dashboard*")
#+end_src

* DIRED
Dired es el gestor de archivos de Emacs. A seguir están la combinaciones de teclas de dired, incluyendo las usadas para ver imágenes en el mismo.

** Combinación de Teclas para Abrir Dired
| COMANDO    | DESCRIPCIÓN                          | COMBINACIÓN DE TECLAS |
|------------+--------------------------------------+-----------------------|
| dired      | /Abrir gestor de archivos dired/       | SPC d d               |
| dired-jump | /Saltar al directorio actual en dired/ | SPC d j               |

** Combinaciones de Teclas Dentro de Dired

*** Comandos básicos de dired
| COMANDO                | DESCRIPCIÓN                                              | COMBINACIÓN DE TECLAS |
|------------------------+----------------------------------------------------------+-----------------------|
| dired-view-file        | /Ver el archivo en dired/                                  | SPC d v               |
| dired-up-directory     | /Subir en el árbol de directorios/                         | h                     |
| dired-find-file        | /Bajar en el árbol de directorios (o abrir si es archivo)/ | l                     |
| dired-next-line        | Bajar a la siguiente línea                               | j                     |
| dired-previous-line    | Subir a la línea anterior                                | k                     |
| dired-mark             | Marcar archivo en el punto                               | m                     |
| dired-unmark           | Desmarcar archivo en el punto                            | u                     |
| dired-do-copy          | Copiar archivo actual o archivos marcados                | C                     |
| dired-do-rename        | Renombrar archivo actual o archivos marcados             | R                     |
| dired-hide-details     | Activar/desactivar listado detallado                     | (                     |
| dired-git-info-mode    | Activar/desactivar información de git                    | )                     |
| dired-create-directory | Crear nuevo directorio vació                             | +                     |
| dired-diff             | Comparar archivo en el punto con otro                    | =                     |
| dired-subtree-toggle   | Alternar visualización del subárbol en el punto          | TAB                   |

*** Comandos de dired usando regex

| COMANDO                 | DESCRIPCIÓN                            | COMBINACIÓN DE TECLAS |
|-------------------------+----------------------------------------+-----------------------|
| dired-mark-files-regexp | Marcar archivos usando regex           | % m                   |
| dired-do-copy-regexp    | Copiar archivos usando regex           | % C                   |
| dired-do-rename-regexp  | Renombrar archivos usando regex        | % R                   |
| dired-mark-files-regexp | Marcar todos los archivos usando regex | * %                   |

*** Permisos y propiedad de archivos

| COMANDO         | DESCRIPCIÓN                                      | COMBINACIÓN DE TECLAS |
|-----------------+--------------------------------------------------+-----------------------|
| dired-do-chgrp  | Cambiar el grupo de los archivos marcados        | g G                   |
| dired-do-chmod  | Cambiar el modo de los archivos marcados         | M                     |
| dired-do-chown  | Cambiar el propietario de los archivos marcados  | O                     |
| dired-do-rename | Renombrar archivos o todos los archivos marcados | R                     |

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("d" . "dired")
       :desc "Abrir dired" "d" #'dired
       :desc "Dired saltar al actual" "j" #'dired-jump)
      (:after dired
       (:map dired-mode-map
        :desc "Vista previa de image peep-dired" "d p" #'peep-dired
        :desc "Dired ver archivo" "d v" #'dired-view-file)))

(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; usar dired-find-file en vez de dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)
;; Obtener iconos para dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; Con el plugin dired-open, podes lanzar programas externos para ciertas extensiones
;; Por ejemplo, todos los .png se abren en 'sxiv' y todos los .mp4 en 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+end_src

** Combinaciones de Teclado con Pee-Dired Activado
Si peep-dired esta activado, tendrás vistas previas de las imágenes a medida que subes y bajas con 'j' y 'k'

| COMANDO              | DESCRIPCIÓN                               | COMBINACIÓN DE TECLAS |
|----------------------+-------------------------------------------+-----------------------|
| peep-dired           | /Alternar vistas previas en dired/          | SPC d p               |
| peep-dired-next-file | /Ir al siguiente archivo en modo pee-dired/ | j                     |
| peep-dired-prev-file | /Ir al archivo anterior en modo pee-dired/  | k                     |

#+BEGIN_SRC emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC

* TEMAS DOOM
Establece el tema de DOOM Emacs. A mi, personalmente, me gusta doom-dracula, pero vos cámbialo si queres. Usa 'SPC h t' para probar otros temas

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-dracula)
(map! :leader
      :desc "Load new theme" "h t" #'counsel-load-theme)
#+END_SRC

* EMOJIS
Emojify mostrar emojis en Emacs.

#+begin_src emacs-lisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src

* EVALUAR EXPRESIONES ELISP
Cambiando algunas combinaciones de sus valores por defecto para que encajen mejor con DOOM Emacs  Por defecto, DOOM Emacs no usa 'SPC e' para nada, así que se usa el formato 'SPC e' más 'tecla' para estos (también se usa 'SPC e' para los comandos 'eww').

| COMANDO         | DESCRIPCIÓN                                       | COMBINACIÓN DE TECLAS |
|-----------------+---------------------------------------------------+-----------------------|
| eval-buffer     | /Evaluar elisp en el buffer/                        | SPC e b               |
| eval-defun      | /Evaluar el defun que contiene o después del punto/ | SPC e d               |
| eval-expression | /Evaluar una expresión elisp/                       | SPC e e               |
| eval-last-sexp  | /Evaluar expresión elisp antes del punto/           | SPC e l               |
| eval-region     | /Evaluar elisp en la región/                        | SPC e r               |

#+Begin_src emacs-lisp
(map! :leader
      (:prefix ("e". "evaluate/ERC/EWW")
       :desc "Evaluar elisp en el buffer" "b" #'eval-buffer
       :desc "Evaluar defun" "d" #'eval-defun
       :desc "Evaluar expresión elisp" "e" #'eval-expression
       :desc "Evaluar ultima sexpression" "l" #'eval-last-sexp
       :desc "Evaluar elisp en la region" "r" #'eval-region))
#+END_SRC

* TIPO DE FUENTE TIPOGRÁFICA
Configuración relacionada con el tipo de fuente tipográfica usada dentro de DOOM Emacs:
+ 'doom-font' -- fuente monoespaciada estándar que es usada para la mayoría de las cosas en Emacs.
+ 'doom-variable-pitch-font' -- fuente variable usada que es útil para algunos plugins de Emacs.
+ 'doom-big-font' -- usado en doom-big-font-mode; útil para presentaciones
+ 'font-lock-comment-face' -- para comentarios.
+ 'font-lock-keyword-face' -- elisp. para palabras clave con significado especial como 'setq' en elisp

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 14)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC


* INSERTAR FECHA
Algunas funciones para insertar fechas. La función 'insert-todays-date' puede usarse de tres maneras diferentes: (1) sólo la combinación de teclas sin el prefijo de argumento universal, (2) con un prefijo de argumento universal, o (3) con dos prefijos de argumento universal. El prefijo de argumento universal es 'SPC-u' en DOOM Emacs (C-u en Emacs normal). La función 'insert-any-date' sólo da salida a un formato, que es el mismo formato que 'insert-todays-date' sin prefijo.

| COMANDO               | EJEMPLO DE RESULTADO      | COMBINACION DE TECLAS |
|-----------------------+---------------------------+-----------------------|
| dt/insert-todays-date | Viernes, Octubre 19, 2021 | SPC i d t             |
| dt/insert-todays-date | 11-19-2021                | SPC u SPC i d t       |
| dt/insert-todays-date | 2021-11-19                | SPC u SPC u SPC i d t |
| dt/insert-any-date    | Viernes, Octubre 19, 2021 | SPC i d a             |

#+begin_src emacs-lisp
(defun dt/insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%A, %B %d, %Y")
                 ((equal prefix '(4)) "%m-%d-%Y")
                 ((equal prefix '(16)) "%Y-%m-%d"))))
    (insert (format-time-string format))))

(require 'calendar)
(defun dt/insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(map! :leader
      (:prefix ("i d" . "Insertar fecha")
        :desc "Insertar cualquier fecha" "a" #'dt/insert-any-date
        :desc "Insertar fecha de hoy" "t" #'dt/insert-todays-date))
#+end_src

* IVY
Ivy es el macanismo generico de auto-completacion para Emacs.

