config.org
** IVY-POSFRAME
Ivy-posframe es una extension de ivy,que deja a ivy usar posframa para mostrar su menu de candidatos. Algunos de los ajustes a continuacion incluyen:
+ ivy-posframe-display-functions-alist -- establece la posición de la pantalla para programas específicos
+ ivy-posframe-height-alist -- establece la altura de la lista mostrada para programas específicos

Funciones disponibles (posiciones) para 'ivy-posframe-display-functions-alist'
+ ivy-posframe-display-at-frame-center
+ ivy-posframe-display-at-window-center
+ ivy-posframe-display-at-frame-bottom-left
+ ivy-posframe-display-at-window-bottom-left
+ ivy-posframe-display-at-frame-bottom-window-center
+ ivy-posframe-display-at-point
+ ivy-posframe-display-at-frame-top-center

=NOTE:= Si el ajuste para 'ivy-postframe-display' esta puesto en 'nil' (falso), todo lo que es puesto para 'ivy-display-function-fallback' simplemente se devolvera a su posición normal en DOOM Emacs (en el divisor bajo). Sin embargo, si esta puesto en 't' (verdadero), entonces la posicion de emergecia sera centrada.

#+BEGIN_SRC emacs-lisp
(setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-top-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 20)
        (dmenu . 20)
        (t . 10)))
(ivy-posframe-mode 1) ; 1 abilita posframe-mode, 0 lo desabilita.
#+END_SRC

** IVY KEYBINDINGS
Por defecto, DOOM Emacs no usa 'SPC v', asi que es formato usado qui sera 'SPC v' mas 'tecla'

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("v" . "Ivy")
       :desc "Ivy empuje vista" "v p" #'ivy-push-view
       :desc "Ivy cambiar vista" "v s" #'ivy-switch-view))
#+END_SRC

* CONFUGRACION DE LINEAS
La línea de comentario esta puesta en 'SPC TAB TAB', que es una combinación de teclas bastante cómoda para varios teclados. La combinación de teclas estándar de Emacs para la línea de comentario es 'C-x C-;'. Las otras combinaciones de teclas son para comandos que activan/desactivan varios ajustes relacionados con la línea. DOOM Emacs usa 'SPC t' para los comandos "toggle", así que usamos 'SPC t' más 'tecla' para esas combinaciones. Aqui tambien se activa la opcion de numero de linea relativo.

| COMANDO                  | DESCRIPCION                                        | COMBINACION DE TECLAS |
|--------------------------+----------------------------------------------------+-----------------------|
| comment-line             | /Comentar o descomentar líneas/                      | SPC TAB TAB           |
| hl-line-mode             | /Alternar el resaltado de líneas en el marco actual/ | SPC t h               |
| global-hl-line-mode      | /Alternar el resaltado de líneas globalmente/        | SPC t H               |
| doom/toggle-line-numbers | /Alternar numeros de línea/                          | SPC t l               |
| toggle-truncate-lines    | /Alternar truncamiento de línea/                     | SPC t t               |

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
(map! :leader
      :desc "Comentar o descomentar líneas" "TAB TAB" #'comment-line
      (:prefix ("t" . "alternar")
       :desc "Alternar numero de línea" "l" #'doom/toggle-line-numbers
       :desc "Alternar el resaltado de líneas en el marco actual" "h" #'hl-line-mode
       :desc "Alternar el resaltado de líneas globalmente" "H" #'global-hl-line-mode
       :desc "Alternar truncamiento de línea" "t" #'toggle-truncate-lines))
#+END_SRC

* MINIMAPA
Un minimapa en la barra lateral que muestra una version pequeña deñ buffer actual ya sea a la izquierda o derecha. Resalta la region actual y actualiza su posicion automaticamente. Este minimapa no funciona en documentos Org.

| COMANDO      | DESCRIPCION            | COMBINACION DE TECLAS |
|--------------+------------------------+-----------------------|
| minimap-mode | /Alternar modo-minimapa/ | SPC t m               |

#+begin_src emacs-lisp
(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "alternar")
       :desc "Alternar modo-minimapa" "m" #'minimap-mode))
#+end_src

* LINEA DE MODOS
La linea de modos es la barra de estado que aparece en la parte inferior de la ventana de Emacs. Para mas informacion en lo que esta disponible para la linea de modos en DOOM, vease: https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :font "Ubuntu Mono-13")
(setq doom-modeline-height 30     ;; ajusta la altura de la linea de modos
      doom-modeline-bar-width 5   ;; ajusta el ancho de la barra derecha
      doom-modeline-persp-name t  ;; añade nombre perspectivo a la linea de modos
      doom-modeline-persp-icon t) ;; añade un icono de carpeta al lado del nombre persp
#+end_src

* SOPORTE PARA RATON
Añade soporte para el raton en version de terminal de Emacs

#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src

* NEOTREE
Neotree es usa visualizador de archivos en arbol. Cuando lo abris, salta directamente al archivo actual gracias a neo-smart-open. La opcion 'neo-window-fixed-size' hace que el ancho de neotree sea ajustable. DOOM Emacs no tiene combinacion de teclas nativa para neotree. Dado que 'SPC t' se usa para comandos de alternacion, 'SPC t n' sera usado para alternar neotree.

| COMANDO        | DESCRIPCION                 | COMBINACION DE TECLAS |
|----------------+-----------------------------+-----------------------|
| neotree-toggle | /Alternar neotree/            | SPC t n               |
| neotree- dir   | /Abrir directorio en neotree/ | SPC d n               |

#+BEGIN_SRC emacs-lisp
(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Alternar neotree" "t n" #'neotree-toggle
      :desc "Abrir directorio en neotree" "d n" #'neotree-dir)
#+END_SRC

* ABRIR ARCHIVOS ESPECIFICOS
Combinaciones de teclas para abrir una variedad de archivos comunmente editados con facilidad con el comando find-file, un buscador de archivos interactivo abrido con 'C-x C-f' en Emacs normal, o 'SPC f f' en DOOM Emacs.

| CAMINO AL ARCHIVO        | DESCRIPCION              | COMBINACION DE TECLAS |
|--------------------------+--------------------------+-----------------------|
| ~/Org/agenda.org         | /Editar archivo de agenda/ | SPC = a               |
| ~/.doom.d/config.org     | /Editar doom config.org/   | SPC = c               |
| ~/.doom.d/init.el        | /Editar doom init.el/      | SPC = i               |
| ~/.doom.d/packages.el    | /Editar doom packages.el/  | SPC = p               |
| ~/.doom.d/eshell/aliases | /Editar aliases de eshell/ | SPC = e a             |
| ~/.doom.d/eshell/profile | /Editar perfil de eshell/  | SPC = e p             |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("=" . "abrir archivo")
       :desc "Editar archivo de agenda" "a" #'(lambda () (interactive) (find-file "~/Org/agenda.org"))
       :desc "Editar doom config.org" "c" #'(lambda () (interactive) (find-file "~/.doom.d/config.org"))
       :desc "Editar doom init.el" "i" #'(lambda () (interactive) (find-file "~/.doom.d/init.el"))
       :desc "Editar doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.doom.d/packages.el"))))
(map! :leader
      (:prefix ("= e" . "abrir archivos de eshell")
       :desc "Editar aliases de eshell" "a" #'(lambda () (interactive) (find-file "~/.doom.d/eshell/aliases"))
       :desc "Editar perfil de eshell" "p" #'(lambda () (interactive) (find-file "~/.doom.d/eshell/profile"))))
#+END_SRC

* MODO ORG
Configuracion generales de Org. Usa 'after! org' para evitar que la configuracion se elimine por la de defecto en DOOM. Hace uso de org-journal, org-superstar y org-roam (+journal + pretty +roam2 en init.el).

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(after! org
  (setq org-directory "~/Org/"
        org-agenda-files '("~/Org/agenda.org")
        org-default-notes-file (expand-file-name "notas.org" org-directory)
        org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("❂" "❁" "❀" "✿" "✾" "✽" "✢")
        org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; cambia los simbolos +/- en las listas de items
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ej. de org-link-abbrev-alist en accion
        ;; [[arch-wiki:Nombre_de_Pagina][Descripcion]]
        org-link-abbrev-alist    ; Esto sobrescribe el org-link-abbrev-list por defecto de DOOM
          '(("google" . "http://www.google.com/search?q=")
            ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
            ("ddg" . "https://duckduckgo.com/?q=")
            ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-table-convert-region-max-lines 20000
        org-todo-keywords        ; Esto sobrescribe los valores por defecto de org-todo-keywords en DOOM
          '((sequence
             "TODO(t)"           ; Una tarea para completar
             "BLOG(b)"           ; Tarea de escritura de blog
             "GYM(g)"            ; Cosas para hacer en el gimnasio
             "PROJ(p)"           ; Un projecto que continene otras tareas
             "VIDEO(v)"          ; Tareas de video
             "WAIT(w)"           ; Algo esta retrasando la tarea
             "|"                 ; Simbolo necesario para separar estados "activos" de estados "inactivos"
             "DONE(d)"           ; La tarea ha sido completada
             "CANCELLED(c)" )))) ; La tarea ha sido cancelada
#+END_SRC

** Org-export
Necesitamos ox-man para "Org eXporting" para manegar formatos y ox-gemini para exportar a gemtext (para el protocolo gemini).

#+BEGIN_SRC emacs-lisp
(use-package ox-man)
(use-package ox-gemini)
#+END_SRC

** Org-journal
#+begin_src emacs-lisp
(setq org-journal-dir "~/Org/diario/"
      org-journal-date-prefix "* "
      org-journal-time-prefix "** "
      org-journal-date-format "%B %d, %Y (%A) "
      org-journal-file-format "%Y-%m-%d.org")
#+end_src

