config.el

(setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-top-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 20)
        (dmenu . 20)
        (t . 10)))
(ivy-posframe-mode 1) ; 1 abilita posframe-mode, 0 lo desabilita.

(map! :leader
      (:prefix ("v" . "Ivy")
       :desc "Ivy empuje vista" "v p" #'ivy-push-view
       :desc "Ivy cambiar vista" "v s" #'ivy-switch-view))

(setq display-line-numbers-type 'relative)
(map! :leader
      :desc "Comentar o descomentar líneas" "TAB TAB" #'comment-line
      (:prefix ("t" . "alternar")
       :desc "Alternar numero de línea" "l" #'doom/toggle-line-numbers
       :desc "Alternar el resaltado de líneas en el marco actual" "h" #'hl-line-mode
       :desc "Alternar el resaltado de líneas globalmente" "H" #'global-hl-line-mode
       :desc "Alternar truncamiento de línea" "t" #'toggle-truncate-lines))

(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "alternar")
       :desc "Alternar modo-minimapa" "m" #'minimap-mode))

(set-face-attribute 'mode-line nil :font "Ubuntu Mono-13")
(setq doom-modeline-height 30     ;; ajusta la altura de la linea de modos
      doom-modeline-bar-width 5   ;; ajusta el ancho de la barra derecha
      doom-modeline-persp-name t  ;; añade nombre perspectivo a la linea de modos
      doom-modeline-persp-icon t) ;; añade un icono de carpeta al lado del nombre persp

(xterm-mouse-mode 1)

(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Alternar neotree" "t n" #'neotree-toggle
      :desc "Abrir directorio en neotree" "d n" #'neotree-dir)

(map! :leader
      (:prefix ("=" . "abrir archivo")
       :desc "Editar archivo de agenda" "a" #'(lambda () (interactive) (find-file "~/Org/agenda.org"))
       :desc "Editar doom config.org" "c" #'(lambda () (interactive) (find-file "~/.doom.d/config.org"))
       :desc "Editar doom init.el" "i" #'(lambda () (interactive) (find-file "~/.doom.d/init.el"))
       :desc "Editar doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.doom.d/packages.el"))))
(map! :leader
      (:prefix ("= e" . "abrir archivos de eshell")
       :desc "Editar aliases de eshell" "a" #'(lambda () (interactive) (find-file "~/.doom.d/eshell/aliases"))
       :desc "Editar perfil de eshell" "p" #'(lambda () (interactive) (find-file "~/.doom.d/eshell/profile"))))

(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(after! org
  (setq org-directory "~/Org/"
        org-agenda-files '("~/Org/agenda.org")
        org-default-notes-file (expand-file-name "notas.org" org-directory)
        org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("❂" "❁" "❀" "✿" "✾" "✽" "✢")
        org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; cambia los simbolos +/- en las listas de items
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ej. de org-link-abbrev-alist en accion
        ;; [[arch-wiki:Nombre_de_Pagina][Descripcion]]
        org-link-abbrev-alist    ; Esto sobrescribe el org-link-abbrev-list por defecto de DOOM
          '(("google" . "http://www.google.com/search?q=")
            ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
            ("ddg" . "https://duckduckgo.com/?q=")
            ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-table-convert-region-max-lines 20000
        org-todo-keywords        ; Esto sobrescribe los valores por defecto de org-todo-keywords en DOOM
          '((sequence
             "TODO(t)"           ; Una tarea para completar
             "BLOG(b)"           ; Tarea de escritura de blog
             "GYM(g)"            ; Cosas para hacer en el gimnasio
             "PROJ(p)"           ; Un projecto que continene otras tareas
             "VIDEO(v)"          ; Tareas de video
             "WAIT(w)"           ; Algo esta retrasando la tarea
             "|"                 ; Simbolo necesario para separar estados "activos" de estados "inactivos"
             "DONE(d)"           ; La tarea ha sido completada
             "CANCELLED(c)" )))) ; La tarea ha sido cancelada

(use-package ox-man)
(use-package ox-gemini)

(setq org-journal-dir "~/Org/diario/"
      org-journal-date-prefix "* "
      org-journal-time-prefix "** "
      org-journal-date-format "%B %d, %Y (%A) "
      org-journal-file-format "%Y-%m-%d.org")
