config.org
** Org-auto-tangle
=org-auto-tangle= te permite añadir la opcion =#+auto_tangle: t= en tu documento Org para que se enmarañe automaticamente cuando guardas en documento.

#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

* MODO ARCOIRIS
El modo arcoiris te permite visualizar el color actual de cualquier valor de color hex. Esto lo hace global (excepto en org-agenda-mode porque se rompe todo).

#+begin_src emacs-lisp
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )
#+end_src

* REGISTROS
Los registros de Emacs son compartimentos en los que puedes guardar texto, rectángulos y posiciones para su uso posterior. Una vez que guardas un texto o un rectángulo en un registro, puedes copiarlo en el buffer una o varias veces; una vez que guardas una posición en un registro, puedes volver a esa posición una o varias veces. Las combinaciones de teclas por defecto de GNU Emacs para estos comandos (con la excepción de counsel-register) implican usar 'C-x r' seguido de una o más teclas. Para hacerlo un poco más amigable para el usuario, y al usar DOOM Emacs, reemplazamos la parte de 'C-x r' con 'SPC r'.

| COMANDO                          | DESCRIPCION                         | COMBINACION DE TECLAS |
|----------------------------------+-------------------------------------+-----------------------|
| copy-to-register                 | /Copiar al registro/                  | SPC r c               |
| frameset-to-register             | /Frameset a registro/                 | SPC r f               |
| insert-register                  | /Insertar contenidos del registro/    | SPC r i               |
| jump-to-register                 | /Saltar al registro/                  | SPC r j               |
| list-registers                   | /Listar registros/                    | SPC r l               |
| number-to-register               | /Numero a registro/                   | SPC r n               |
| counsel-register                 | /Elejir interactivamente un registro/ | SPC r r               |
| view-register                    | /Ver un registro/                     | SPC r v               |
| window-configuration-to-register | /COnfiguracion de ventana a register/ | SPC r w               |
| increment-register               | /Incrementar registro/                | SPC r +               |
| point-to-register                | /Apuntar a registro/                  | SPC r SPC             |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("r" . "registros")
       :desc "Copiar al registro" "c" #'copy-to-register
       :desc "Frameset a registro" "f" #'frameset-to-register
       :desc "Insertar contenidos del registro" "i" #'insert-register
       :desc "Saltar a registro" "j" #'jump-to-register
       :desc "Listar registros" "l" #'list-registers
       :desc "Numero a registro" "n" #'number-to-register
       :desc "Elehjir interactivamente un registro" "r" #'counsel-register
       :desc "Ver un registro" "v" #'view-register
       :desc "Configuracion de ventana a registro" "w" #'window-configuration-to-register
       :desc "Incrementar registro" "+" #'increment-register
       :desc "Apuntar a registro" "SPC" #'point-to-register))
#+END_SRC

* SHELLS
Configuraciones para los varios shells y emuladores de terminal dentro de Emacs.
+ 'shell-file-name' -- fija la shell para sel usada en M-x shell, M-x term, M-x ansi-term y M-x vterm.
+ 'eshell-aliases-file' -- fija un archivo de aliases para la shell

#+BEGIN_SRC emacs-lisp
(setq shell-file-name "/bin/sh"
      vterm-max-scrollback 5000)
(setq eshell-rc-script "~/.doom.d/eshell/profile"
      eshell-aliases-file "~/.doom.d/eshell/aliases"
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("zsh" "bash" "fish" "htop" "ssh" "top"))
(map! :leader
      :desc "Eshell" "e s" #'eshell
      :desc "Alternar eshell emergente" "e t" #'+eshell/toggle
      :desc "Historial eshell" "e h" #'counsel-esh-history
      :desc "Alternar vterm emergente" "v t" #'+vterm/toggle)
#+END_SRC

* SPLITS
Configuracion para que se abran por defecto a la derecha usando 'prefer-horizontal-split'. Estableze una combinaci de teclas para 'clone-indirect-buffer-other-window' para cuando se quiere tener el mismo documento en dos splits. El texto del buffer indirecto es siempre idéntico al de su buffer base; los cambios realizados al editar cualquiera de ellos son visibles inmediatamente en el otro.  Pero en todos los demás aspectos, el buffer indirecto y su buffer base están completamente separados.

#+BEGIN_SRC emacs-lisp
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; bajar como se vaya necesitando
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clonar buffer indirecto otra ventana" "b c" #'clone-indirect-buffer-other-window)
#+END_SRC

* MODO WINNER
El modo winner ha estado en Emacs desde la version 20. Es un modo global y, cuando activado, permite "deshacer" (y "rehacer") cambios en la configuracion de la ventana con las combinaciones 'SPC w <izquierda>' y 'SPC w <derecha>'.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner rehacer" "<derecha>" #'winner-redo
       :desc "Winner deshacer" "<izquierda>" #'winner-undo))
#+END_SRC

* ZAP-TO-CHAR
Emacs proporciona un comando 'zap-to-char' que mata desde el punto actual a un carácter. Está ligado a 'M-z' en Emacs estándar, pero como DOOM Emacs usa 'SPC' como su tecla líder y no tiene 'SPC z' ligado a nada, asi que tiene sentido usarlo para 'zap-to-char'. Tenga en cuenta que 'zap-to-char' puede utilizarse con el argumento universal 'SPC u' para modificar su comportamiento. En la siguiente tabla se muestran ejemplos de uso de 'zap-to-char':

| COMBINACION DE TECLAS     | QUE HACE                                                            |
|---------------------------+---------------------------------------------------------------------|
| SPC z e                   | borra todos los caracteres hasta la siguiente aparición de'e'       |
| SPC u 2 SPC z e           | borra todos los caracteres hasta la segunda aparición de'e'         |
| SPC u - SPC z e           | borra todos los caracteres hasta la previa aparición de 'e'         |
| SPC u - 2 SPC z e         | borra todos los caracteres hasta la segunda previa aparición de 'e' |
| SPC u 1 0 0 SPC u SPC z e | borra todos los caracteres hasta la 100ª aparición de 'e'           |

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Zap to char" "z" #'zap-to-char
      :desc "Zap up to char" "Z" #'zap-up-to-char)
#+END_SRC
