config.el

(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )

(map! :leader
      (:prefix ("r" . "registros")
       :desc "Copiar al registro" "c" #'copy-to-register
       :desc "Frameset a registro" "f" #'frameset-to-register
       :desc "Insertar contenidos del registro" "i" #'insert-register
       :desc "Saltar a registro" "j" #'jump-to-register
       :desc "Listar registros" "l" #'list-registers
       :desc "Numero a registro" "n" #'number-to-register
       :desc "Elehjir interactivamente un registro" "r" #'counsel-register
       :desc "Ver un registro" "v" #'view-register
       :desc "Configuracion de ventana a registro" "w" #'window-configuration-to-register
       :desc "Incrementar registro" "+" #'increment-register
       :desc "Apuntar a registro" "SPC" #'point-to-register))

(setq shell-file-name "/bin/sh"
      vterm-max-scrollback 5000)
(setq eshell-rc-script "~/.doom.d/eshell/profile"
      eshell-aliases-file "~/.doom.d/eshell/aliases"
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("zsh" "bash" "fish" "htop" "ssh" "top"))
(map! :leader
      :desc "Eshell" "e s" #'eshell
      :desc "Alternar eshell emergente" "e t" #'+eshell/toggle
      :desc "Historial eshell" "e h" #'counsel-esh-history
      :desc "Alternar vterm emergente" "v t" #'+vterm/toggle)

(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; bajar como se vaya necesitando
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clonar buffer indirecto otra ventana" "b c" #'clone-indirect-buffer-other-window)

(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner rehacer" "<derecha>" #'winner-redo
       :desc "Winner deshacer" "<izquierda>" #'winner-undo))

(map! :leader
      :desc "Zap to char" "z" #'zap-to-char
      :desc "Zap up to char" "Z" #'zap-up-to-char)
